In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv('data_science_student_marks.csv')
df.head()

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75

In [3]:
df.shape

(497, 8)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497 entries, 0 to 496
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   student_id      497 non-null    int64
 1   location        497 non-null    object
 2   age             497 non-null    int64
 3   sql_marks       497 non-null    int64
 4   excel_marks     497 non-null    int64
 5   python_marks    497 non-null    int64
 6   power_bi_marks  497 non-null    int64
 7   english_marks   497 non-null    int64
dtypes: int64(7), object(1)
memory usage: 31.2+ KB

In [5]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
student_id,497.0,NaN,NaN,NaN,252.0,143.615807,4.0,128.0,252.0,376.0,500.0
location,497,9,Tokyo,60,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,497.0,NaN,NaN,NaN,21.380282,2.205714,18.0,20.0,21.0,23.0,25.0
sql_marks,497.0,NaN,NaN,NaN,84.661972,8.745415,70.0,78.0,85.0,92.0,100.0
excel_marks,497.0,NaN,NaN,NaN,85.384306,8.782497,70.0,78.0,86.0,93.0,100.0
python_marks,497.0,NaN,NaN,NaN,85.38833,8.878668,70.0,77.0,86.0,94.0,100.0
power_bi_marks,497.0,NaN,NaN,NaN,84.545272,8.903066,70.0,77.0,84.0,92.0,100.0
english_marks,497.0,NaN,NaN,NaN,84.82495,9.060479,70.0,77.0,85.0,93.0,100.0

In [6]:
df.isnull().sum()

student_id        0
location          0
age               0
sql_marks         0
excel_marks       0
python_marks      0
power_bi_marks    0
english_marks     0
dtype: int64

In [7]:
df.duplicated().sum()

np.int64(0)

In [8]:
sum_columns=['sql_marks', 'excel_marks', 'python_marks', 'power_bi_marks', 'english_marks']
df['total_marks']=df[sum_columns].sum(axis=1)

In [9]:
df.head()

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks
0,4,Sydney,24,95,99,87,82,75,438
1,5,Tokyo,24,99,95,89,86,82,451
2,6,Berlin,22,72,70,99,79,77,397
3,7,London,23,97,90,74,72,85,418
4,8,Tokyo,22,91,71,79,80,75,396

In [10]:
df['rank']=df['total_marks'].rank(method='min', ascending=False).astype(int)
df.head()

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
0,4,Sydney,24,95,99,87,82,75,438,117
1,5,Tokyo,24,99,95,89,86,82,451,37
2,6,Berlin,22,72,70,99,79,77,397,454
3,7,London,23,97,90,74,72,85,418,311
4,8,Tokyo,22,91,71,79,80,75,396,461

In [11]:
df['location'].value_counts()

location
Tokyo          60
Los Angeles    60
Melbourne      58
New York       57
Toronto        56
Paris          55
Sydney         53
Berlin         52
London         46
Name: count, dtype: int64

In [12]:
top_5=df[df['rank']<=5]
top_5

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
35,39,Melbourne,20,88,99,99,92,89,467,5
170,174,Melbourne,25,93,100,100,95,96,484,1
234,238,Toronto,21,93,90,90,98,97,468,2
255,259,Paris,23,83,98,95,100,92,468,2
382,386,New York,19,94,91,99,85,99,468,2
435,439,Berlin,21,92,99,96,92,88,467,5

In [13]:
top_10=df.sort_values(by='rank', ascending=True).head(10)
top_10

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
170,174,Melbourne,25,93,100,100,95,96,484,1
255,259,Paris,23,83,98,95,100,92,468,2
234,238,Toronto,21,93,90,90,98,97,468,2
382,386,New York,19,94,91,99,85,99,468,2
435,439,Berlin,21,92,99,96,92,88,467,5
35,39,Melbourne,20,88,99,99,92,89,467,5
383,387,Tokyo,19,93,96,77,100,98,464,7
197,201,Melbourne,25,100,91,75,99,98,463,8
389,393,Melbourne,18,78,90,97,99,99,463,8
180,184,Los Angeles,25,99,88,96,90,90,463,8

In [14]:
#top 10 students from Melbourne City
mel_dt=df[df['location']=='Melbourne']
mel_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
170,174,Melbourne,25,93,100,100,95,96,484,1
35,39,Melbourne,20,88,99,99,92,89,467,5
197,201,Melbourne,25,100,91,75,99,98,463,8
389,393,Melbourne,18,78,90,97,99,99,463,8
259,263,Melbourne,24,99,83,97,86,97,462,12
249,253,Melbourne,19,85,99,94,85,97,460,15
257,261,Melbourne,18,83,91,91,95,99,459,17
231,235,Melbourne,22,79,90,87,95,100,451,37
305,309,Melbourne,19,95,99,81,75,98,448,47
153,157,Melbourne,23,97,99,70,91,90,447,54

In [15]:
#top 10 students from Tokyo City
tok_dt=df[df['location']=='Tokyo']
tok_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
383,387,Tokyo,19,93,96,77,100,98,464,7
388,392,Tokyo,20,87,96,89,94,95,461,13
320,324,Tokyo,19,97,94,90,94,82,457,23
486,490,Tokyo,18,87,100,95,89,85,456,26
6,10,Tokyo,18,77,87,100,98,93,455,28
474,478,Tokyo,21,98,89,94,75,97,453,33
254,258,Tokyo,21,80,100,98,100,75,453,33
133,137,Tokyo,19,79,98,98,95,82,452,36
1,5,Tokyo,24,99,95,89,86,82,451,37
89,93,Tokyo,25,98,80,89,80,100,447,54

In [16]:
#top 10 students from Toronto City
tor_dt=df[df['location']=='Toronto']
tor_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
234,238,Toronto,21,93,90,90,98,97,468,2
462,466,Toronto,22,97,86,94,83,99,459,17
116,120,Toronto,20,98,100,87,90,82,457,23
328,332,Toronto,20,95,85,82,95,94,451,37
454,458,Toronto,20,83,92,92,84,97,448,47
23,27,Toronto,21,92,79,93,82,99,445,69
185,189,Toronto,19,100,94,88,74,88,444,75
181,185,Toronto,18,92,86,99,72,93,442,88
176,180,Toronto,22,82,92,84,95,88,441,94
417,421,Toronto,18,91,90,90,83,87,441,94

In [17]:
#top 10 students from Paris City
par_dt=df[df['location']=='Paris']
par_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
255,259,Paris,23,83,98,95,100,92,468,2
159,163,Paris,21,87,95,97,85,96,460,15
70,74,Paris,22,81,100,78,96,99,454,31
447,451,Paris,19,96,81,88,98,87,450,42
157,161,Paris,25,91,93,96,93,75,448,47
224,228,Paris,20,87,91,96,80,92,446,60
481,485,Paris,21,89,98,96,83,79,445,69
412,416,Paris,22,92,91,94,71,96,444,75
449,453,Paris,19,89,83,94,82,96,444,75
264,268,Paris,21,91,81,100,99,72,443,83

In [18]:
#top 10 students from Sydney City
syd_dt=df[df['location']=='Sydney']
syd_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
362,366,Sydney,19,91,92,90,94,96,463,8
119,123,Sydney,23,92,89,83,97,98,459,17
22,26,Sydney,18,90,91,89,94,93,457,23
97,101,Sydney,21,86,90,89,93,97,455,28
154,158,Sydney,23,82,100,100,98,75,455,28
414,418,Sydney,21,84,100,97,99,73,453,33
138,142,Sydney,19,81,97,83,88,100,449,46
372,376,Sydney,23,100,93,76,85,94,448,47
208,212,Sydney,23,98,95,88,95,72,448,47
465,469,Sydney,20,86,99,82,92,88,447,54

In [19]:
#top 10 students from Berlin City
bel_dt=df[df['location']=='Berlin']
bel_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
435,439,Berlin,21,92,99,96,92,88,467,5
393,397,Berlin,21,82,94,81,99,95,451,37
155,159,Berlin,25,97,82,84,88,99,450,42
173,177,Berlin,18,70,95,99,100,83,447,54
16,20,Berlin,25,92,87,81,79,98,437,125
85,89,Berlin,20,99,85,86,86,80,436,135
365,369,Berlin,19,75,85,94,100,82,436,135
337,341,Berlin,21,72,93,83,100,88,436,135
191,195,Berlin,25,80,97,99,87,72,435,150
66,70,Berlin,23,81,100,83,93,78,435,150

In [20]:
#top 10 students from London City
lon_dt=df[df['location']=='London']
lon_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
9,13,London,19,97,80,96,97,86,456,26
448,452,London,19,89,96,91,91,87,454,31
149,153,London,25,87,90,74,99,100,450,42
352,356,London,22,79,90,94,97,87,447,54
302,306,London,22,100,94,89,93,70,446,60
298,302,London,22,80,92,91,86,97,446,60
301,305,London,25,94,90,90,91,80,445,69
165,169,London,22,95,83,96,97,74,445,69
244,248,London,22,88,94,94,79,87,442,88
350,354,London,20,76,87,100,84,95,442,88

In [21]:
#top 10 students from Los Angeles City
los_dt=df[df['location']=='Los Angeles']
los_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
180,184,Los Angeles,25,99,88,96,90,90,463,8
203,207,Los Angeles,18,95,83,94,89,100,461,13
358,362,Los Angeles,22,100,79,91,88,100,458,21
251,255,Los Angeles,19,88,83,99,82,99,451,37
71,75,Los Angeles,25,99,79,92,92,84,446,60
373,377,Los Angeles,23,88,89,98,96,75,446,60
390,394,Los Angeles,22,92,83,86,96,87,444,75
189,193,Los Angeles,19,91,76,88,93,95,443,83
349,353,Los Angeles,24,93,91,82,96,81,443,83
418,422,Los Angeles,21,87,100,88,84,81,440,101

In [22]:
#top 10 students from New York City
nyc_dt=df[df['location']=='New York']
nyc_dt.sort_values('total_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
382,386,New York,19,94,91,99,85,99,468,2
103,107,New York,24,94,92,90,98,85,459,17
82,86,New York,25,93,88,93,85,99,458,21
86,90,New York,21,98,88,74,97,93,450,42
290,294,New York,22,88,96,77,100,87,448,47
280,284,New York,21,76,94,95,92,91,448,47
284,288,New York,18,96,83,82,90,96,447,54
178,182,New York,19,92,71,100,89,92,444,75
55,59,New York,21,91,98,95,88,72,444,75
56,60,New York,19,95,94,94,83,78,444,75

In [23]:
#Average scores of students across their respective location
df.groupby('location')['total_marks'].mean().astype(int).sort_values(ascending=False)

location
London         427
New York       427
Tokyo          427
Melbourne      425
Sydney         425
Los Angeles    423
Toronto        423
Paris          422
Berlin         420
Name: total_marks, dtype: int64

In [24]:
#Top students based on sql marks
df.sort_values('sql_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
129,133,Melbourne,21,100,90,80,73,74,417,325
261,265,London,18,100,82,73,77,91,423,261
185,189,Toronto,19,100,94,88,74,88,444,75
197,201,Melbourne,25,100,91,75,99,98,463,8
311,315,London,23,100,77,100,81,70,428,224
358,362,Los Angeles,22,100,79,91,88,100,458,21
372,376,Sydney,23,100,93,76,85,94,448,47
306,310,Los Angeles,22,100,81,74,88,70,413,363
87,91,London,21,100,95,81,86,70,432,188
34,38,Berlin,21,100,95,78,73,77,423,261

In [25]:
#Top students based on excel marks
df.sort_values('excel_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
88,92,Paris,18,98,100,71,86,77,432,188
414,418,Sydney,21,84,100,97,99,73,453,33
116,120,Toronto,20,98,100,87,90,82,457,23
461,465,Paris,22,94,100,83,82,83,442,88
170,174,Melbourne,25,93,100,100,95,96,484,1
254,258,Tokyo,21,80,100,98,100,75,453,33
227,231,Melbourne,21,74,100,87,98,77,436,135
368,372,Toronto,25,79,100,90,71,82,422,276
418,422,Los Angeles,21,87,100,88,84,81,440,101
70,74,Paris,22,81,100,78,96,99,454,31

In [26]:
#Top students based on python marks
df.sort_values('python_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
338,342,London,18,95,74,100,89,78,436,135
350,354,London,20,76,87,100,84,95,442,88
18,22,Los Angeles,22,83,73,100,75,85,416,335
154,158,Sydney,23,82,100,100,98,75,455,28
369,373,Sydney,19,81,83,100,74,72,410,389
170,174,Melbourne,25,93,100,100,95,96,484,1
311,315,London,23,100,77,100,81,70,428,224
356,360,Melbourne,25,99,86,100,90,71,446,60
136,140,London,19,76,84,100,88,70,418,311
6,10,Tokyo,18,77,87,100,98,93,455,28

In [27]:
#Top students based on power_bi marks
df.sort_values('power_bi_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
383,387,Tokyo,19,93,96,77,100,98,464,7
422,426,Tokyo,20,80,75,83,100,98,436,135
36,40,New York,22,70,78,79,100,85,412,373
317,321,Sydney,19,95,70,87,100,81,433,176
322,326,Tokyo,19,82,85,87,100,75,429,212
115,119,Berlin,25,86,74,83,100,91,434,161
290,294,New York,22,88,96,77,100,87,448,47
101,105,Toronto,21,80,91,72,100,79,422,276
173,177,Berlin,18,70,95,99,100,83,447,54
365,369,Berlin,19,75,85,94,100,82,436,135

In [28]:
#Top students based on english marks
df.sort_values('english_marks', ascending=False).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,rank
308,312,Toronto,20,76,99,71,73,100,419,304
443,447,Berlin,22,71,71,71,73,100,386,488
184,188,Toronto,21,85,72,83,94,100,434,161
89,93,Tokyo,25,98,80,89,80,100,447,54
19,23,New York,18,80,73,94,89,100,436,135
47,51,London,23,96,96,71,74,100,437,125
358,362,Los Angeles,22,100,79,91,88,100,458,21
203,207,Los Angeles,18,95,83,94,89,100,461,13
138,142,Sydney,19,81,97,83,88,100,449,46
231,235,Melbourne,22,79,90,87,95,100,451,37